Revit 2027 API
SynchronizeWithCentralOptions Methods
The SynchronizeWithCentralOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetRelinquishOptions |  Gets the options which govern whether or not to relinquish elements and workset types.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetRelinquishOptions |  Sets the options which govern whether or not to relinquish elements and workset types.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace